---
kind: method
id: M:Autodesk.Revit.Exceptions.CentralModelVersionArchivedException.GetObjectData(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
source: html/656ad575-f049-fe8c-644a-d6f65a3058c0.htm
---
# Autodesk.Revit.Exceptions.CentralModelVersionArchivedException.GetObjectData Method

Retrieves data needed to serialize the target object.

## Syntax (C#)
```csharp
public override void GetObjectData(
	SerializationInfo info,
	StreamingContext context
)
```

## Parameters
- **info** (`System.Runtime.Serialization.SerializationInfo`) - Data needed to serialize or deserialize the object.
- **context** (`System.Runtime.Serialization.StreamingContext`) - The destination of the serialized stream.